# Cherre SQL Query Test

This notebook is broken down between an overview of the 'test.db' file and the SQL commands that add the ten most frequent users in descending order to the 'frequent_browsers' table in the database.

In [1]:
# Imports the necessary libraries
import sqlite3
import pandas as pd

In [2]:
# Creates the connection to the database and a cursor
connection = sqlite3.connect(r'ProgrammerTest/testdb.db')
cursor = connection.cursor()

In [3]:
# Obtains the names of the tables in 'test.db'
cursor.execute("SELECT name FROM sqlite_master WHERE type='table' ORDER BY name;")
available_tables = (cursor.fetchall())

In [4]:
# Prints the table names
for i in available_tables:
    print(i)

('frequent_browsers',)
('people',)
('sites',)
('sqlite_sequence',)
('visits',)

In [5]:
# This function returns the queried contents of a table
# The wildcard '*' can be given as an argument

def print_table_contents(table_name, query, database = connection):
    cursor = database.cursor()
    cursor.execute("SELECT {} FROM {};".format(query, table_name))
    return cursor.fetchall()

In [6]:
# This function takes in a SQL query and returns the result
# as a pandas dataframe

def create_pandas_table(sql_query, database = connection):
    table = pd.read_sql_query(sql_query, database)
    return table

# Table Schemas and Contents

In terminal I pulled up the schemas of the individual tables by typing the following commands:

`cd ProgrammerTest` (Accesses the folder containing the test.db file)

`sqlite3` (Opens a SQLite3 shell)

`.open testdb.db` (Opens the 'destdb.db' file)

`.schema table_name` (Pulls up the schema for a given table)

The table schemas are commented out in the first cell of each section.

## Table 1: frequent_browsers

In [7]:
# CREATE TABLE frequent_browsers
# (
# 	person_id int not null
# 		constraint frequent_browsers_people_id_fk
# 			references people,
# 	num_sites_visited int not null
# );

print_table_contents('frequent_browsers', '*')

[]

In [8]:
create_pandas_table('''SELECT * from frequent_browsers;''')

Empty DataFrame
Columns: [person_id, num_sites_visited]
Index: []

## Table 2: people

In [9]:
# CREATE TABLE people
# (
# 	id integer
# 		constraint people_pk
# 			primary key autoincrement,
# 	first_name varchar(50) not null,
# 	last_name varchar(50) not null
# );

print(print_table_contents('people', '*'))

[(1, 'Terrance', 'Ta'), (2, 'Annabelle', 'Guttierrez'), (3, 'Terri', 'Alli'), (4, 'Genevie', 'Digby'), (5, 'Leann', 'Lindon'), (6, 'Alvin', 'Bergey'), (7, 'Aaron', 'Laubscher'), (8, 'Yon', 'Kubat'), (9, 'Lavera', 'Beliveau'), (10, 'Theola', 'Anton'), (11, 'Shayla', 'Brunner'), (12, 'Sung', 'Aitchison'), (13, 'Bart', 'Sowell'), (14, 'Joselyn', 'Navarette'), (15, 'Temeka', 'Welke'), (16, 'Lin', 'Kenton'), (17, 'Arlie', 'Hewitt'), (18, 'Fredia', 'Gammill'), (19, 'Alena', 'Jacobson'), (20, 'Susy', 'Sheckler'), (21, 'Franklyn', 'Marceau'), (22, 'Gwyn', 'Grasser'), (23, 'Macy', 'Holdaway'), (24, 'Jodi', 'Razo'), (25, 'Cruz', 'Russom'), (26, 'Eugena', 'Hanning'), (27, 'Nicki', 'Donato'), (28, 'Jaimee', 'Siniard'), (29, 'Donnell', 'Mcelrath'), (30, 'Alena', 'Jacobson')]

In [10]:
people = create_pandas_table('''SELECT * from people;''')
people.head()

   id first_name   last_name
0   1   Terrance          Ta
1   2  Annabelle  Guttierrez
2   3      Terri        Alli
3   4    Genevie       Digby
4   5      Leann      Lindon

## Table 3: sites

In [11]:
# CREATE TABLE sites (
#   id INTEGER PRIMARY KEY AUTOINCREMENT,
#   url varchar(255) NOT NULL
# );

print(print_table_contents('sites', '*'))

[(1, 'youtube.com'), (2, 'facebook.com'), (3, 'baidu.com'), (4, 'yahoo.com'), (5, 'amazon.com'), (6, 'wikipedia.org'), (7, 'qq.com'), (8, 'google.co.in'), (9, 'twitter.com'), (10, 'live.com'), (11, 'taobao.com'), (12, 'bing.com'), (13, 'instagram.com'), (14, 'weibo.com'), (15, 'sina.com.cn'), (16, 'linkedin.com'), (17, 'yahoo.co.jp'), (18, 'msn.com'), (19, 'vk.com'), (20, 'google.de'), (21, 'yandex.ru'), (22, 'hao123.com'), (23, 'google.co.uk'), (24, 'reddit.com'), (25, 'ebay.com'), (26, 'google.fr'), (27, 't.co'), (28, 'tmall.com'), (29, 'google.com.br'), (30, '360.cn'), (31, 'sohu.com'), (32, 'amazon.co.jp'), (33, 'pinterest.com'), (34, 'netflix.com'), (35, 'google.it'), (36, 'google.ru'), (37, 'microsoft.com'), (38, 'google.es'), (39, 'wordpress.com'), (40, 'gmw.cn'), (41, 'tumblr.com'), (42, 'paypal.com'), (43, 'blogspot.com'), (44, 'imgur.com'), (45, 'stackoverflow.com'), (46, 'aliexpress.com'), (47, 'naver.com'), (48, 'ok.ru'), (49, 'apple.com'), (50, 'github.com'), (51, 'chinadaily.com.cn'), (52, 'imdb.com'), (53, 'google.co.kr'), (54, 'fc2.com'), (55, 'jd.com'), (56, 'blogger.com'), (57, '163.com'), (58, 'google.ca'), (59, 'whatsapp.com'), (60, 'amazon.in'), (61, 'office.com'), (62, 'tianya.cn'), (63, 'google.co.id'), (64, 'youku.com'), (65, 'rakuten.co.jp'), (66, 'craigslist.org'), (67, 'amazon.de'), (68, 'nicovideo.jp'), (69, 'google.pl'), (70, 'soso.com'), (71, 'bilibili.com'), (72, 'dropbox.com'), (73, 'xinhuanet.com'), (74, 'outbrain.com'), (75, 'pixnet.net'), (76, 'alibaba.com'), (77, 'alipay.com'), (78, 'microsoftonline.com'), (79, 'booking.com'), (80, 'googleusercontent.com'), (81, 'google.com.au'), (82, 'popads.net'), (83, 'cntv.cn'), (84, 'zhihu.com'), (85, 'amazon.co.uk'), (86, 'diply.com'), (87, 'coccoc.com'), (88, 'cnn.com'), (89, 'bbc.co.uk'), (90, 'twitch.tv'), (91, 'wikia.com'), (92, 'google.co.th'), (93, 'go.com'), (94, 'google.com.ph'), (95, 'doubleclick.net'), (96, 'onet.pl'), (97, 'googleadservices.com'), (98, 'accuweather.com'), (99, 'googleweblight.com'), (100, 'answers.yahoo.com')]

In [12]:
create_pandas_table('''SELECT * from sites;''').head()

   id           url
0   1   youtube.com
1   2  facebook.com
2   3     baidu.com
3   4     yahoo.com
4   5    amazon.com

## Table 4: sqlite_sequence

In [13]:
# CREATE TABLE sqlite_sequence(name,seq);

print(print_table_contents('sqlite_sequence', '*'))

[('people', 30), ('sites', 100)]

In [14]:
create_pandas_table('''SELECT * from sqlite_sequence;''').head()

     name  seq
0  people   30
1   sites  100

## Table 5: visits

In [15]:
#CREATE TABLE IF NOT EXISTS "visits"
# (
# 	personId int
# 		constraint people_fk
# 			references people (id),
# 	siteId int not null
# 		constraint sites_fk
# 			references sites (id),
# 	time_visited datetime
# );

#I do not call 'print_table_contents()' here because there are 306 entries
print("Number of entries in 'visits' table:", len(create_pandas_table('''SELECT * from visits;''')))

Number of entries in 'visits' table: 306

In [16]:
visits = create_pandas_table('''SELECT * from visits;''')
visits.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 306 entries, 0 to 305
Data columns (total 3 columns):
personId        306 non-null int64
siteId          306 non-null int64
time_visited    306 non-null object
dtypes: int64(2), object(1)
memory usage: 7.2+ KB

In [17]:
visits.head()

   personId  siteId         time_visited
0        17      41  2005-08-23 03:52:02
1         6      58  2015-08-25 09:03:46
2         3      98  2007-04-01 23:14:45
3         0      52  2007-12-08 13:28:58
4         6      37  2013-02-21 21:12:10

# The SQL Commands

I outline my thought process for the SQL commands in this section. There are additional queries that are the building blocks for the final query that is used in the `.py` and `.sql` files.

## Instructions:

Given the attached SQLiteDB (testdb.db), make a program in any language which does the following:
1. find the ten people who have visited the most sites
2. list these people in descending order of the number of sites they've visited in a table called FrequentBrowsers
3. upload your solution, along with instructions on how to run it, to a public repository on GitHub
4. email the repository link to Cherre

The `frequent_browsers` table has two columns: `person_id` and `num_sites_visited`. I include an additional query (query_3) which checks the names of the users in addition to the user ids and unique website count.

In [18]:
# I group the 'personId' and 'siteId' columns from the 'visits' table to see the
# unique sites each person visits. A user's duplicate visits to a site are not counted.

command_1 = '''SELECT visits.personId, visits.siteId, COUNT(DISTINCT personId) FROM visits
            GROUP BY visits.personId, visits.siteId;'''

# I view the first ten rows of the query to ensure only unique sites are counted
create_pandas_table(command_1).head(10)

   personId  siteId  COUNT(DISTINCT personId)
0         0       0                         1
1         0       7                         1
2         0       9                         1
3         0      36                         1
4         0      47                         1
5         0      52                         1
6         0      71                         1
7         0      92                         1
8         1       1                         1
9         1       7                         1

In [19]:
# This is the main query. The original "visits" table includes the "personId"
# for each user, the "siteId" of the website, and the "time_visited" when the user
# logged on to the site.

# I group the subquery by the "personId" and the "siteId" to pair each
# user-site interraction. There is a distinct count (unique_sites) of personIds
# where a '1' is added to the column for each unique pair.

# The query calls the subquery and pulls the "personId" and count ("unique_site_visits")
# of the "unique_sites" where the count is grouped by the "personId".
# The results are sorted by the "personId" and limited to the top ten frequent users.


command_2 = '''SELECT personId, SUM(unique_sites) AS unique_site_visits FROM(
                    SELECT personId, COUNT(DISTINCT personId) AS unique_sites FROM visits
                    GROUP BY personId, siteId
                    )
                    GROUP BY personId
                    ORDER BY unique_site_visits DESC
                    LIMIT 10;'''

create_pandas_table(command_2).head(10)

   personId  unique_site_visits
0        30                  23
1        19                  16
2         3                  15
3         6                  15
4         2                  13
5        14                  12
6        26                  12
7         9                  11
8        11                  11
9        15                  11

In [20]:
# This is a check of the previous SQL query to see the names of the frequent users
# Two user accounts have the name "Alena Jacobson" and they are the number one and two
# most frequent site visitors
# It is possible for two people to have the same name, and the names are
# correctly linked to the proper user ids.

command_3 = '''SELECT personId, first_name, last_name, SUM(unique_sites) AS unique_site_visits FROM(
                    SELECT visits_talley.personId, people.first_name, people.last_name, COUNT(DISTINCT visits_talley.personId) AS unique_sites FROM visits AS visits_talley
                    JOIN people
                    ON people.id = visits_talley.personId
                    GROUP BY personId, siteId
                    )
                    GROUP BY personId
                    ORDER BY unique_site_visits DESC
                    LIMIT 10;'''

create_pandas_table(command_3).head(10)

   personId first_name   last_name  unique_site_visits
0        30      Alena    Jacobson                  23
1        19      Alena    Jacobson                  16
2         3      Terri        Alli                  15
3         6      Alvin      Bergey                  15
4         2  Annabelle  Guttierrez                  13
5        14    Joselyn   Navarette                  12
6        26     Eugena     Hanning                  12
7         9     Lavera    Beliveau                  11
8        11     Shayla     Brunner                  11
9        15     Temeka       Welke                  11

In [21]:
# This command inserts the results of the main query "command_2" into the
# "frequent_browsers" table

command_4 = ('''INSERT INTO frequent_browsers (person_id, num_sites_visited)
                     SELECT personId, SUM(unique_sites) AS unique_site_visits FROM(
                         SELECT personId, COUNT(DISTINCT personId) AS unique_sites FROM visits
                             GROUP BY personId, siteId
                                 )
                        GROUP BY personId
                        ORDER BY unique_site_visits DESC
                        LIMIT 10;''')

cursor.execute(command_4)

In [22]:
# A test to see if the 'frequent_browsers' table was updated with the results

create_pandas_table('''SELECT * FROM frequent_browsers;''')

   person_id  num_sites_visited
0         30                 23
1         19                 16
2          3                 15
3          6                 15
4          2                 13
5         14                 12
6         26                 12
7          9                 11
8         11                 11
9         15                 11

In [23]:
# This block of code commits the changes to the 'frequent_browsers' table

connection.commit()